# # # Quiz empty room

# #go to the south
# 0 ***X -> S 0
# 0 ***S -> W 1
# #go west
# 1 **X* -> W 1
# 1 **W* -> E 2
# # go east
# 2 *X**  -> E 2
# 2 *E**  -> N 1



# #Quiz maze(Right-hand rule)

# #Rule N(go North)
# 0 XE** -> N 0
# 0 *X** -> E 1
# 0 NE** -> X 2
# #Rule E (go East)
# 1 *X*S -> E 1
# 1 ***X -> S 3
# 1 *E*S -> X 0
# #Rule W
# 2 N*X* -> W 2
# 2 X*** -> N 0
# 2 N*W* -> X 3
# #Rule S
# 3 **WX -> S 3
# 3 **X* -> W 2
# 3 **WS -> X 1


# # #Quiz diamon room
# #Go west 
# 0 **X* -> W 0
# 0 *XW* -> E 1

# #GO East
# 1 *X** -> E 1
# 1 *EX* -> W 2
# 2 **** -> N 0

# #go south and loop again
# 0 *EWX -> S 3
# 3 ***X -> S 3
# 3 *EWS -> N 0




# # ############ Quiz 4

# #東西往下刷
# 0 *X** -> E 18
# 0 *E** -> W 19
# 18 *X** -> E 18
# 18 *E** -> W 19
# 19 **X* -> W 19
# 19 **WX -> S 18
# 19 **WS -> E 20
# 20 *X** -> E 20
# 20 *E*X -> S 19
# 20 *E*S -> N 1


# #東西往上刷
# #0 **X* -> W 1
# #0 **W* -> E 3
# 1 **X* -> W 2
# 1 **W* -> E 3
# 2 **X* -> W 2
# 2 XXW* -> E 3
# 3 *X** -> E 3
# 3 XE** -> N 1

# #東西刷卡住
# 2 NxWx -> E 3

# #東西刷刷完，南北刷往西邊刷不重複
# 3 NE*X -> S 15
# 15 ***X -> S 15
# 15 **XS -> W 16
# 15 **WS -> E 17
# 16 X*** -> N 16
# 16 N*X* -> W 15
# 16 N*W* -> E 17
# 17 *X** -> E 17
# 17 *E*X -> S 4
# 17 *E*S -> N 5

# #南北向往西邊刷重複跑

# 4 ***X -> S 4
# 4 ***S -> N 5
# 5 X*** -> N 5
# 5 N*X* -> W 4

# #北西有牆壁往東邊，東西刷
# 5 N*W* -> E 6
# 6 *X** -> E 6
# 6 *E*X -> S 7
# 7 **X* -> W 7
# 7 **W* -> E 6

# #東西刷結束，卡東南，往北到底，往西到底
# 6 *E*S -> N 8
# 8 X*** -> N 8
# 8 N*** -> W 9
# 9 **X* -> W 9
# 9 **W* -> S 10

# #南北刷往西
# 10 ***X -> S 10
# 10 **XS -> W 11
# 11 X*** -> N 11
# 11 N*X* -> W 10
# #西北卡住，往南走
# 11 N*W* -> S 10
# #西南卡住，往北走
# 10 **WS -> N 12
# 12 X***  -> N 12

# #南北刷往東
# 12 N*** -> E 18




